[{"workload": "2-0-0-2-6", "exam": {"date": "2012-04-27", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1830", "location": "LT15"}]}], "preclusion": "Nil", "code": "CS5219", "desc": "null", "tutorial_time_table": "null", "prerequisite": "CS3212 or equivalent", "name": "Automated Software Validation"}, {"workload": "0-3-0-2-5", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "SEMINAR-STYLE MODULE CLASS Class [1]", "sessions": [{"endtime": "2130", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1830", "location": "AS3/0207"}]}], "preclusion": "NIL", "code": "CSA6770", "desc": "This is a required module for all PhD candidates in Cultural Studies in Asia programme. It is a forum for candidates to engage each other in critical discussion of their dissertation and other research projects. Each candidate is required to present a formal research paper. Active participation from each is expected. The module will be graded Satisfactory/Unsatisfactory' on the basis of a candidate's presentation and participation in discussions throughout the semester.", "tutorial_time_table": "null", "prerequisite": "NIL", "name": "Graduate Research Seminar"}, {"workload": "2-0-1-5.5-1.5", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1830", "location": "SR@LT19"}]}], "preclusion": "NIL", "code": "CS5343", "desc": "From the covert digital water in Titanic to the mixed real and virtual actors in Avatar, from the arm-controllable Wii games to the completely full-body-play Xbox Kinect games, computer animation technologies have advanced significantly during the past decades, both in the movie and the game industries. This module reveals all the exciting behind-the-scene techniques that make these movies and games possible, including but not limited to motion capture, fluid animation, facial animation, and fullbody character animation. This is a project-based course that aims to provide strong foundation on advanced computer animation methods and prepare students for research in animation.", "tutorial_time_table": "null", "prerequisite": "(CS2010 or CS2020) and MA1101R and MA1521 and CS3241. Good-to-have background: CS4342; CS5240; PC1141; MA1104; CS3244. Good-to have skills: strong in programming; comfortable with math, reading, and public presentation.", "name": "Advanced Computer Animation"}, {"workload": "2-0-0-6-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1830", "location": "SR@LT19"}]}], "preclusion": "Nil", "code": "CS5342", "desc": "null", "tutorial_time_table": "null", "prerequisite": "CS4341", "name": "Multimedia Computing and Applications"}, {"workload": "2-0-1-0-7", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1830", "location": "SR@LT19"}]}], "preclusion": "Nil", "code": "CS5341", "desc": "null", "tutorial_time_table": "null", "prerequisite": "CS4243", "name": "Computational Photography"}, {"workload": "2-0-0-6-2", "exam": {"date": "2012-05-02", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1830", "location": "LT19"}]}], "preclusion": "NIL", "code": "CS5322", "desc": "Database security has a great impact on the design of today's information systems. This course will provide an overview of database security concepts and techniques and discuss new directions of database security in the context of Internet information management. Topics covered include: Access control models for DBMSs, Inference controls, XML database security, Encrypted databases, Digital credentials and PKIs, Trust in open systems, and Peer-to-peer system security.", "tutorial_time_table": "null", "prerequisite": "CS3223 Database Systems Implementation", "name": "Database Security"}, {"workload": "2-0-0-3-5 (10hr)", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1830", "location": "COM1/203"}]}], "preclusion": "Nil", "code": "CS5241", "desc": "This module exposes the graduate students to the fundamental theory of speech processing, focusing primarily on automatic speech recognition. Upon completion of this module, students should be able to perform research on speech recognition topics and commercial speech technology development. Topics covered by this module include: speech signal processing, automatic speech recognition (ASR), continuous speech recognition, acoustic modelling using the Hidden Markov Model (HMM), language modelling for ASR and advanced speech recognition techniques for state-of-the-art large vocabulary continuous speech recognition (adaptation and robustness, discriminative training and decoding strategies).", "tutorial_time_table": "null", "prerequisite": "(CS1020 or its equivalent) and CS1231 and (MA1102R or MA1505 or MA1521) and (MA1101R or MA1506)", "name": "Speech Processing"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-05-04", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1830", "location": "LT15"}]}], "preclusion": "Nil", "code": "CS5239", "desc": "The objective of this module is to provide students a working knowledge of computer performance evaluation and capacity planning. They will be able to identify performance bottlenecks, to predict when performance limits of a system will be exceeded, and to characterise present and future workload to perform capacity planning activities. Topics include: performance analysis overview; measurement techniques and tools including workload characterisation, instrumentation, benchmarking, analytical modelling techniques including operational analysis, stochastic queuing network analysis; performance of client-server architectures; capacity planning; case studies.", "tutorial_time_table": "null", "prerequisite": "CS1020 or its equivalent", "name": "Computer System Performance Analysis"}, {"workload": "3-0-0-3-4", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1830", "location": "COM1/210"}]}], "preclusion": "Nil", "code": "CS5237", "desc": "The course aims to provide students with a geometric viewpoint in problem solving. It lays a foundation for solving problems with computational geometric methods, and bridges the gap between theoretical computer science and the real applications by introducing application areas, such as bio-geometric modelling, computer graphics and mesh generation, as well as other engineering problems such as reverse engineering. Topics include: convex-hull algorithms, simplicial complexes, union of balls, Voronoi diagram, Delaunay triangulation, lifting and projecting, alpha shape, surface reconstruction, sphere algebra, orthogonality and complementarity, molecular skin surfaces, curvatures and surface meshing, deformation and morphing, etc.", "tutorial_time_table": "null", "prerequisite": "CS1231 and CS3230", "name": "Computational Geometry and Applications"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-05-03", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1830", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS5233", "desc": "This course aims to provide students with a working knowledge of applying simulation techniques to model, simulate and study complex systems. It covers techniques in simulation model design, model execution and model analysis. Model design techniques include conceptual models, declarative models, functional models, constraint models, and multi-models. Model execution techniques include serial and parallel discrete-event simulation algorithms. Topics in model analysis include input-output analysis and experiment design. Students will have hands-on experience using a simulation package that we have developed.", "tutorial_time_table": "null", "prerequisite": "(CS1020 or its equivalent) and (MA1102R or MA1505 or MA1505C or MA1521) and (MA1101R or MA1506) and (ST1232 or ST2131 or ST2334)", "name": "Simulation and Modelling Techniques"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-26", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1830", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS5232", "desc": "The primary role of the formal specification is to provide a precise and unambiguous description of a computer system. A formal specification allows the system designer to verify important properties and detect design error before system development begins. The objective of this course is to study various formal specification and design techniques for modelling (1) object-oriented systems, (2) real-time distributed systems, and (3) concurrent reactive systems. The course will focus on the state-based notations Z/Object-Z, event-based notation CSP/Timed-CSP. Graphical modelling notations, such as StateChart and UML (Unified Modelling Language) will also be addressed.", "tutorial_time_table": "null", "prerequisite": "CS1231 or CS3234", "name": "Formal Specification and Design Techniques"}, {"workload": "2-0-0-4-4", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1830", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS5231", "desc": "This module introduces fundamental notions and requirements in computer security, such as the concepts of confidentiality, integrity and availability, and the mechanisms that provide security in various systems and applications. To illustrate relevant concepts, selected topics in information security, including symmetric key cipher and PKI, operating system security, network security, web security, and database security will be covered. Case studies of existing systems, international standards such as IPSec, and well-known attacks like phishing and buffer overflow will also be covered.", "tutorial_time_table": "null", "prerequisite": "CS1231, CS2105, CS2106.", "name": "Systems Security"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-30", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2130", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1830", "location": "COM1/212"}]}], "preclusion": "CS4230", "code": "CS5230", "desc": "The aim of this module is to study the various measures of difficulty of problem solving in computing, and to introduce some techniques in theoretical computer science such as non-determinism, digitalisation, simulation, padding, reduction, randomisation and interaction. Topics covered include: space and time complexity - the classes P, NP, co-NP, PSPACE, EXP, etc.; tape compression; linear speedup; polynomial reduction; Cook's theorem; Savitch's theorem; translation lemma; Gap theorem; NP-completeness and NP-hard problems; probabilistic complexity classes; approximation algorithms; and interactive protocols.", "tutorial_time_table": "null", "prerequisite": "CS3231", "name": "Computational Complexity"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-24", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1830", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS5226", "desc": "This module is concerned with the performance related database administration issues. The topics include: an overview of query optimisation techniques, physical data base design, system configuration, buffer management, performance analysis and tuning techniques.", "tutorial_time_table": "null", "prerequisite": "CS3223, CS4221", "name": "Database Tuning"}, {"workload": "2-0-0-4-4", "exam": {"date": "2012-04-28", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1830", "location": "COM1/204"}]}], "preclusion": "NIL", "code": "CS5222", "desc": "The aim of this module is to introduce the state-of-the-art architectural advances underlying the current generation of computing systems. A review of pipelined processor design and hierarchical memory design is followed by advanced topics including exploitation of instruction-level parallelism through dynamic instruction scheduling and speculation, exploiting thread-level parallelism through multiprocessors, and optimizations for memory and storage subsystems. Throughout the module, particular emphasis will be placed on cost-performance-power-reliability trade-offs in designing the different architectural components.", "tutorial_time_table": "null", "prerequisite": "CS2106 and (CS3220 or CS4223)", "name": "Advanced Computer Architecture"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-21", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1830", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS5214", "desc": "The performance gap between optimised and unoptimised code continues to widen as modern processors evolve. Notably, the emerging explicitly parallel instruction computing (EPIC) processors are significantly dependent on a range of aggressive program optimisations to yield performance. This module provides an in-depth study of code optimisation techniques used in compilers for state-of-the-art processors. Topics covered include structure of an optimising compiler, the program dependence graph, front end optimisations, instruction scheduling, register allocation, compiling for EPIC processors including predicated execution and software pipelining with hardware support, loop optimisations, dataflow analysis and optimisation, optimisations for the memory hierarchy, and automatic parallelisation.", "tutorial_time_table": "null", "prerequisite": "CS3212 or CS4212", "name": "Design of Optimising Compilers"}, {"workload": "3-0-0-3-4", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2130", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1830", "location": "COM2/108"}]}], "preclusion": "Nil", "code": "CS4880", "desc": "The course will cover trends in the digital marketplace and emerging high-growth opportunities for digital businesses. The course will highlight issues facing companies with new products and services in an ever-changing digital marketplace. While the course will provide an overview on structuring of new ventures, the primary focus will be on opportunity identification and sources of competitive differentiation, particularly as they relate to digital innovation. To hone these skills the students will communicate by crafting a business plan.", "tutorial_time_table": "null", "prerequisite": "Students in their 3rd year of study in science, technology or business", "name": "Digital Entrepreneurship"}, {"workload": "0-1-3-12-4 (First Sem: Team Work Project) ; 10 (Second Sem: Independent Project)", "exam": "null", "mc": "12", "lecture_time_table": "null", "preclusion": "CS4101 B.Comp. Dissertation", "code": "CS4349", "desc": "This module aims to build up students&#8217; ability in doing independent research in game technology by involving immersing themselves in team-based game development projects in the first semester, and independently advancing the game technology they have explored during the development projects in the second semester. The project may be proposed jointly by staff, students and industrial partners. Towards the end of the module, students are required to submit a report describing their work, and give oral presentation and demonstration before a panel of examiners.", "tutorial_time_table": "null", "prerequisite": "CS3248 Design of Interactive Systems or CS4213 Game Development.Department approval is required", "name": "Media Research Project."}, {"workload": "2-0-1-5-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "AS6/421"}]}], "preclusion": "CS5245 (old code).", "code": "CS4340", "desc": "This module aims at teaching multimedia techniques for creating digital specia effects video. It allows the students to explore their creativity while extending their skills in multimedia technologies. Topics covered include elements of special effects, camera work, storyline and storyboard, digital compositing, matchmoving, video effects, CG effects, 2D/3D morphing, realistic rendering, sound effects, case studies. The students are required to analyse and critique special effects in movies. The module culminates in a short video project that demonstrates the students&#8217; creativity and innovation in using various techniques to create a captivating and stunning digital special effects video.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "AS6/421"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "AS6/421"}]}], "prerequisite": "CS3343 and (CS4243 or CS4247 or CS4342)", "name": "Digital Special Effects"}, {"workload": "1-1-2-5-1", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS4273", "desc": "This module will cover the design, construction and validation of embedded systems. Students will embark on a good-sized embedded system project on an ARM-based platform, which will include producing detailed specifications and design documents, implementing the application system, and demonstrating that their prototype meets the specifications. Students will gain hands-on experience of working in teams to build a complete embedded system and understand the interplay between the hardware platform, real-time operating systems (RTOS) and the embedded software. Experience accrued will include adapting RTOS to specific embedded environments, and low level device programming. Example projects include calculators, MP3 players, and digital clocks.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "COM1/B09"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1300", "location": "COM1/215"}]}], "prerequisite": "(CG2271 or CS2271) and (CS3215 or CS3202)", "name": "Embedded Software Design Project"}, {"workload": "2-0-1-3-3", "exam": {"date": "2012-04-24", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "900", "location": "COM1/206"}]}], "preclusion": "Nil", "code": "CS4271", "desc": "The objective of this module is to introduce formal verification techniques for validating safety critical reactive systems with specific focus on embedded systems. It covers an automated formal verification technique called Model Checking, which is based on state space search. The different parts of the course will touch upon: (a) formal modelling (b) verification via Model Checking (c) state space reduction techniques to make model checking space/time efficient and (d) specific issues in validation of reactive embedded systems.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1100", "location": "COM1/113"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1100", "location": "COM1/114"}]}], "prerequisite": "(CS1104 or CS2100 or EE2006 or EE2020) and (CS1231 or MA1100)", "name": "Critical Systems and Their Verification"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS4247", "desc": "This module provides a general treatment of real-time and offline rendering techniques in 3D computer graphics. Specific topics include the raster graphics pipeline, viewing and transformation, real-time mapping techniques, real-time shadow algorithms, local reflection models, global illumination, distributed ray tracing, photon mapping, radiosity, volume rendering, image-based rendering and modelling, and strategies for anti-aliasing and photo-realism.", "tutorial_time_table": "null", "prerequisite": "CS3241", "name": "Graphics Rendering Techniques"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "NIL", "code": "CS4246R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "AI Planning and Decision Making"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-23", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "LT15"}]}], "preclusion": "Nil", "code": "CS4244", "desc": "This is a module that contains both the theory and practice of building knowledge-based systems. The aim of this module is to prepare students so that they can design and build knowledge-based systems to solve real-world problems. The module starts with motivations, background and history of knowledge-based system development. The main content has five parts: rule-based programming language, uncertainty management, knowledge-based systems design, development and life cycle, efficiency in rule-based language and knowledge-based systems design examples.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "SR@LT19"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1300", "location": "SR@LT19"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "SR@LT19"}]}], "prerequisite": "CS3243", "name": "Knowledge-Based Systems"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS4243R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Computer Vision and Pattern Recognition"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-28", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "900", "location": "SR@ICube"}]}], "preclusion": "Nil", "code": "CS4241", "desc": "With the proliferation digital media, more and more information is available in non-textual forms. The ability to index, manage and retrieve media contents is of paramount importance. This module introduces the theory, design and technologies of media search. It covers the design of media search engine, the extraction of media features and their indexing, media concept annotation, media search paradigms, and interactive search. It also covers the applications of media search in social media, enterprise and personal media.", "tutorial_time_table": "null", "prerequisite": "CS3245 Information Retrieval and CS3246 Hypermedia and World Wide Web", "name": "Multimedia Information Retrieval"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-21", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/208"}]}], "preclusion": "Nil", "code": "CS4236", "desc": "This module aims to introduce the foundation, principles and concepts behind cryptology and the design of secure communication systems. The emphasis is on the formulation and techniques of various cryptographic primitives, and on the secure usage of such primitives to achieve the goals of confidentially, integrity, and authenticity in both theoretical settings and practical scenarios. Basic topics include pseudorandom functions, symmetric key encryption, public key encryption, message authentication codes, hash functions, digital signatures, key exchange and PKI. Selected topics may include: secret sharing, TCP/IP security, Kerberos, SSL, trusted computing, side-channel attacks.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1300", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/209"}]}], "prerequisite": "CS2107 Introduction to Information & System Security and CS3230 Design and Analysis of Algorithm.", "name": "Cryptography Theory and Practice"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-30", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "LT19"}]}], "preclusion": "Nil", "code": "CS4231", "desc": "This course will examine some fundamental issues in parallel programming and distributed computing, and the relationships between the two. Parallel programming: mutual exclusion, semaphores, consistency, wait-free synchronization. Distributed computing: time, global state, snapshots, message ordering. Relationships: consensus, fault-tolerance, transactions, self-stabilization.", "tutorial_time_table": "null", "prerequisite": "CS3230 Design and Analysis of Algorithms or CS3210 Parallel Computing", "name": "Parallel and Distributed Algorithms"}, {"workload": "2-0-2-4-2", "exam": {"date": "2012-05-02", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/212"}]}], "preclusion": "Nil", "code": "CS4222", "desc": "This primary goal of this module is to introduce students to two major types of wireless networks. First, concepts in cellular networking, including the various generations of cellular networks are introduced. Important concepts related to the design of air interfaces, MAC protocol, QoS, spectrum allocation, mobility management are presented. Second, the students are introduced to the emerging area of sensor networks. Here, the major topic covered are MAC, routing and transport protocols. In this module, there is a strong emphasis on exposing students to practical network system issues by encouraging them to build software prototypes as part of their assessments.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/B01"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "COM1/B01"}]}], "prerequisite": "CS3103 or CG3204L", "name": "Wireless Computing and Sensor Networks"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS4220R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Knowledge Discovery Methods in Bioinformatics"}, {"workload": "2-1-0-4-3", "exam": {"date": "2012-05-02", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM2/108"}]}], "preclusion": "Nil", "code": "CS4220", "desc": "The advent of high throughput technologies (e.g, DNA chips, microarray, etc), biologists are being overloaded with lots of information (e.g., gene expression data). To be able to make sense out of these data, there is a need to have a systematic way to analyse them. This course is introduced to provide students with knowledge of techniques that can be used to analyse biological data to enable them to discover new knowledge. At the end of the course, students will be able to identify the relevant techniques for different biological data to uncover new information. Topics include: Clustering analysis, classification, association rule mining; support vector machines; Hidden Markov Models.", "tutorial_time_table": "null", "prerequisite": "CS2220 or LSM2104", "name": "Knowledge Discovery Methods in Bioinformatics"}, {"workload": "2-1-0-4-3", "exam": {"date": "2012-05-04", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/204"}]}], "preclusion": "NIL", "code": "CS4217", "desc": "This module aims to provide students with an appreciation of the technologies and tools available in support of the software development life cycle. Through assignments and projects, students will learn various technologies and tools that dramatically improve the productivity of the development process and the quality of product. They will also gain an appreciation of how choosing the wrong technologies and tools can be disastrous to the project, and the pitfalls and opportunities for automation of software development. Topics include cost benefit analysis of using automation tools, tool selection, implementation success criteria, tool evaluations, piloting tools and tool demos.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/204"}]}], "prerequisite": "CS3213 Software Systems Design", "name": "Software Development Technologies"}, {"workload": "3-0-0-3-4", "exam": {"date": "2012-04-27", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS4216", "desc": "This course introduces the programming methodology of Constraint Logic Programming (CLP). It first covers programming in PROLOG, the basic CLP programming language. The main part of the course covers modelling of complex problems using constraints and rules, and the use of advanced algorithms that are supported by the constraint solvers in modern CLP systems. Also covered are the mathematical foundations of CLP. Throughout the course, practical exercises are performed using a modern CLP system such as CLP(R) or Eclipse.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1300", "location": "COM1/210"}]}], "prerequisite": "CS3234", "name": "Constraint Logic Programming"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "NIL", "code": "CS4215R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Programming Language Implementation"}, {"workload": "2-0-2-4-2", "exam": {"date": "2012-05-03", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/212"}]}], "preclusion": "NIL", "code": "CS4215", "desc": "This module provides the students with theoretical knowledge and practical skill in the implementation of programming languages. It discusses implementation aspects of fundamental programming paradigms (imperative, functional and object-oriented), and of basic programming language concepts such as binding, scope, parameter-passing mechanisms and types. It introduces the language processing techniques of interpretation and compilation and virtual machines. The lectures are accompanied by lab sessions which will focus on language processing tools, and take the student through a sequence of programming language implementations. This modules also covers automatic memory management, dynamic linking and just-in-time compilation, as features of modern execution systems.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "I3/3-47"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "I3/3-47"}]}], "prerequisite": "(CS2010 Data Structures and Algorithms II or its equivalent) and CS2104 Programming Language Concepts", "name": "Programming Language Implementation"}, {"workload": "1-0-1-6-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/212"}]}], "preclusion": "CS4343 or NM4343", "code": "CS4204", "desc": "This module is the first part of a two-part series on the development of digital games. The aim of these modules is to allow student teams to apply game design principles and algorithms to create a complete digital game. Each team will work on a game development project in a selected exploration theme related to game technology, platform or design. This second part focuses on the game implementation aspects including real-time algorithms and data structures for behavioural and perception models, navigation, collision detection, animation and rendering. Student selection will be enforced to ensure balance of students&#8217; ability to create games.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "AS6/421"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "AS6/421"}]}], "prerequisite": "CS4203 Game Development Project I", "name": "Game Development Project II"}, {"workload": "1-0-0-5-4", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/202"}]}], "preclusion": "CS4348 Interactive Systems Project", "code": "CS4202", "desc": "This module is the second part of a two-part series on the development of interactive systems for various applications. The aim of these modules is to allow students to apply design and engineering principles to interactive system development and management. This second part focuses on the implementation of an interactive solution designed and documented in CS4201. In addition, the students will also learn to design and perform summative evaluations (such as controlled experiments) of their completed systems with real users. Student selection will be enforced to ensure that they have the abilities to complete the projects.", "tutorial_time_table": "null", "prerequisite": "CS4201 Interactive Systems Development Project I", "name": "Interactive Systems Project II"}, {"workload": "2-0-0-7-1", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "900", "location": "COM2/108"}]}], "preclusion": "Nil", "code": "CS3882", "desc": "This module provides students the opportunity to explore and conceptualize new digital products or services that will impact people and enterprises. Students will cultivate the importance of thinking &#8220;design&#8221; for the purpose of developing valuable, captivating and usable digital products or services. The module will provide students with insights into the innovation process and case studies of successful innovation. Exposure to ideas from leading companies and serial entreprenurs will motivate ideation. Students will be required to benchmark their ideas for competitive positioning.", "tutorial_time_table": "null", "prerequisite": "Read and passed 80 MCs of modules. Students from Engineering, Science, and FASS with sufficient computing background and have read and passed 80 MCs of module may also apply to read. Student selection process will be enforced.", "name": "Breakthrough Ideas for Digital Markets"}, {"workload": "2-1-0-4-3", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS3343", "desc": "Development of digital media products such as videos, games, animations and digital special effects require both technical skills and artistic creativity. Common to these different media is the process of digital media production. This module aims at introducing the process of digital media production, in particular, video production. It covers pre-production, production and post-production processes, focusing on main activities such as storyboarding, camera, lighting, audio/sound, directing, recording and digital editing. The students will learn both artistic expression and the technical skills of using digital equipment and software tools. They will also engage in hands-on practice of digital video production.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "AS6/421"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "AS6/421"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1500", "location": "AS6/421"}]}], "prerequisite": "SoC students: CS1020 or its equivalent; CNM students: NM2208", "name": "Digital Media Production"}, {"workload": "2-2-0-4-2", "exam": "null", "mc": "4", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS3282", "desc": "This module is the second part of a two-part series on the development of large-scaled computer systems to solve real-world problems under specific themes such as healthcare, security and surveillance, tourism, etc. Students with complementary technical expertise will form project teams to work on real-world projects under the supervision of CS professors and industrial partners. This second part focuses on the development of algorithms required for the systems, implementation and testing of the algorithms and the systems, and evaluation of the systems according to the users&#8217; requirements.", "tutorial_time_table": "null", "prerequisite": "CS3281 and have passed at least two primary modules in a CS focus area. Student selection process will be enforced.", "name": "Thematic Systems Project II"}, {"workload": "2-2-0-4-2", "exam": "null", "mc": "4", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS3281", "desc": "This module is the first part of a two-part series on the development of large-scaled computer systems to solve real-world problems under specific themes such as healthcare, security and surveillance, tourism, etc. Students with complementary technical expertise will form project teams to work on real-world projects under the supervision of CS professors and industrial partners. This first part focuses on the analysis of the real-world problems, formulation of the computing requirements of the desired solution that meets the user&#8217;s needs, design of the computer systems according to the requirements, and evaluation of the design.", "tutorial_time_table": "null", "prerequisite": "CS2103 and have passed at least one primary module in a CS focus area. Student selection process will be enforced.", "name": "Thematic Systems Project I"}, {"workload": "2-1-2-3-2", "exam": {"date": "2012-04-23", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/212"}]}], "preclusion": "EE3304, EE/CPE students", "code": "CS3271", "desc": "Reactive systems are real-time systems that continuously interact with the environment. This module introduces students to the software engineering principles for designing systems such as controllers and signal processors that are used in a wide variety of settings, including industrial plants, chemical reactors, flight and automotive controllers and robots. Topics to be covered will include fundamentals of control software, programming languages for real-time controllers, and verification and optimisation of software for digital control systems. Apart from a variety of programming assignments, this course will also introduce students to some relevant research topics in this area.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/114"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/114"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1700", "location": "COM1/210"}]}], "prerequisite": "CG2271 or CS2271", "name": "Software Engineering for Reactive Systems"}, {"workload": "2-1-0-4-3", "exam": "null", "mc": "4", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS3249", "desc": "This module introduces the fundamental concepts in the design and implementation of user interfaces. Emphasis will be placed on the design and implementation of user interface in general, including graphical user interface. After taking this module, students will acquire practical knowledge and skills in the design and implementation of general user interfaces. Topics covered include style of user interface, interface devices, design guidelines, implementation tools, design elements and issues, and information visualization.", "tutorial_time_table": "null", "prerequisite": "CS1020 or its equivalent", "name": "Elements of User Interface Design"}, {"workload": "2-1-1-4-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/202"}]}], "preclusion": "Nil", "code": "CS3248", "desc": "The module focuses on the design of interactive computing systems that enhance and support the cognitive and creative processes of their users. It emphasizes the creative design of innovative solutions. Throughout the course, students will learn the design principles and interactive solutions in application domains such as safety, security, surveillance, biomedical informatics and healthcare, or in specific technological areas such as interactive and digital media, social computing, tangible user interface, human robot interaction, and mobile HCI. They will put into practice various design principles through small-scaled design assignments. They will also learn use user-centred evaluation methods for evaluating the design.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "AS6/421"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "AS6/426"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "AS6/421"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1500", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "COM1/215"}]}], "prerequisite": "SoC Students: CS3249 and CS3240. For FASS students: NM2217", "name": "Design of Interactive Systems"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "CS4341 Multimedia Technologies", "code": "CS3246R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Hypermedia and World Wide Web"}, {"workload": "2-1-0-5-2", "exam": {"date": "2012-04-24", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/212"}]}], "preclusion": "NIL", "code": "CS3245", "desc": "This module discusses the basic concepts and methods of information retrieval including capturing, representing, storing, organizing, and retrieving unstructured or loosely structured information. The most well-known aspect of information retrieval is document retrieval: the process of indexing and retrieving text documents. However, the field of information retrieval includes almost any type of unstructured or semi-structured data, including newswire stories, transcribed speech, email, blogs, images, or video. Therefore, information retrieval is a critical aspect of Web search engines. This module also serves as the foundation for subsequent modules on the understanding, processing and retrieval of particular web media.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1300", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/211"}]}], "prerequisite": "CS2010 Data Structures and Algorithms II or its equivalent", "name": "Information Retrieval"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "EEE and CPE students can only take this module as a technical elective to satisfy the program requirements or UEM but not CFM/ULR-Breadth.", "code": "CS3243R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Foundations of Artificial Intelligence"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-25", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "LT19"}]}], "preclusion": "EEE and CPE students can only take this module as a technical elective to satisfy the program requirements or UEM but not CFM/ULR-Breadth.", "code": "CS3243", "desc": "The module introduces the basic concepts in search and knowledge representation as well as to a number of sub-areas of artificial intelligence. It focuses on covering the essential concepts in AI. The module covers Turing test, blind search, iterative deepening, production systems, heuristic search, A* algorithm, minimax and alpha-beta procedures, predicate and first-order logic, resolution refutation, non-monotonic reasoning, assumption-based truth maintenance systems, inheritance hierarchies, the frame problem, certainly factors, Bayes' rule, frames and semantic nets, planning, learning, natural language, vision, and expert systems and LISP.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM2/105"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1300", "location": "COM2/105"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM2/106"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1300", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM2/107"}]}], "prerequisite": "(CS2010 or its equivalent) and (CS1231 or MA1100).", "name": "Introduction to Artificial Intelligence"}, {"workload": "2-1-0-3-3", "exam": {"date": "2012-04-28", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "LT15"}]}], "preclusion": "EEE and CPE students can only take this module as a technical elective to satisfy the program requirements or UEM but not CFM/ULR-Breadth.", "code": "CS3241", "desc": "This module teaches some graphics hardware devices, reviews the mathematics related to the understanding, and discusses the fundamental areas of computer graphics. After completing the course, students are expected to understand the basic computer graphics terminology and concepts, and to be able to design and implement simple 2D and 3D interactive computer graphics related programs. As an enrichment part of the course, students are introduced the state-of-the-art development in computer graphics by viewing interesting video clips and experimenting with demo program made available in the course web.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "AS6/426"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1300", "location": "AS6/426"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "AS6/426"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1500", "location": "AS6/426"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "AS6/426"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1300", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1500", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1300", "location": "COM1/209"}]}], "prerequisite": "CS1020 or its equivalent", "name": "Computer Graphics"}, {"workload": "2-1-0-3-3", "exam": {"date": "2012-04-21", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "LT19"}]}], "preclusion": "Nil", "code": "CS3234", "desc": "This module focuses on the deductive and algorithmic aspects of both classical and non-classical logics. It introduces logic as a means for specifying, verifying and reasoning about computer programs. It emphasises, in contrast to other similar logic courses, on how logic can be used to represent computational problems, how these representations can be proven correct and how they can be executed on a computer. Topics covered include classical logic theories, logic programming, modal logic, and an introduction to non-standard logics. Treatments of predicate calculus and temporal logic are fully covered with emphasis on their specification, verification, deductive and algorithmic aspects.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/120"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/120"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1100", "location": "COM1/215"}]}], "prerequisite": "CS1231 or MA1100; Programming experience is preferred.", "name": "Logic and Formal Systems"}, {"workload": "2-1-0-3-3", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1800", "location": "COM1/120"}]}], "preclusion": "Nil", "code": "CS3233", "desc": "This module aims to prepare students in competitive problem solving. It covers techniques for attacking and solving challenging computational problems. Fundamental algorithmic solving techniques covered include divide and conquer, greedy, dynamic programming, backtracking and branch and bound. Domain specific techniques like number theory, computational geometry, string processing and graph theoretic will also be covered. Advanced AI search techniques like iterative deepening, A* and heuristic search will be included. The module also covers algorithmic and programming language toolkits used in problem solving supported by the solution of representative or well-known problems in the various algorithmic paradigms.", "tutorial_time_table": "null", "prerequisite": "At least grade 'A-' in (CS2010 or its equivalent) or special permission.", "name": "Competitive Programming"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "NIL", "code": "CS3230R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read host module. Student selection process is enforced.", "name": "Design and Analysis of Algorithms"}, {"workload": "2-1-0-3-3", "exam": {"date": "2012-05-03", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "LT15"}]}], "preclusion": "EEE and CPE students can only take this module as a technical elective to satisfy the program requirements or UEM but not CFM/ULR-Breadth.", "code": "CS3230", "desc": "This module introduces different techniques of designing and analysing algorithms. Students will learn about the framework for algorithm analysis, for example, lower bound arguments, average case analysis, and the theory of NP-completeness. In addition, students are exposed to various algorithm design paradigms. The module serves two purposes: to improve the students' ability to design algorithms in different areas, and to prepare students for the study of more advanced algorithms. The module covers lower and upper bounds, recurrences, basic algorithm paradigms (such as prune-and-search, dynamic programming, branch-and-bound, graph traversal, and randomised approaches), amortized analysis, NP-completeness, and some selected advanced topics.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1500", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1300", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1700", "location": "COM1/208"}]}], "prerequisite": "(CS2010 or its equivalent) and (CS1231 or MA1100)", "name": "Design and Analysis of Algorithms"}, {"workload": "2-1-0-4-3", "exam": {"date": "2012-04-25", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM2/108"}]}], "preclusion": "Nil", "code": "CS3225", "desc": "After the complete sequencing of a number of genomes, we are in the stage to understand the mystery of our body, that is, we need to understand the information encoded in the genome and its relationship with RNA and protein. This aim of this module is to cover algorithms related to this stage. In the module, we will cover the algorithms related to genome annotation, motif identification, proteomics, population genetics, microarray, etc.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1700", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "COM2/107"}]}], "prerequisite": "(CS2010 or its equivalent) and (CS2220 or LSM2104)", "name": "Combinatorial Methods in Bioinformatics"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS3223R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Database Systems Implementation"}, {"workload": "0-0-2-0-3", "exam": "null", "mc": "2", "lecture_time_table": "null", "preclusion": "None", "code": "CS3103L", "desc": "The objective of the module is to augment the concepts learnt in the area of networking through hands on experiments, and thus maximizing the educational experience of students. It provides an opportunity for students to interconnect LANs in the laboratory using switches, routers, terminal servers etc., and conduct various experiments relating to TCP/IP protocol stack. Students perform hands-on experiments in subnetting, dail-up service, DHCP, DNS, Multicast, RIP, OSPF, router based firewall, TCP handshaking and congestion mechanism.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/B02"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/B02"}]}], "prerequisite": "Co-read CS3103", "name": "Computer Networks Laboratory"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS2220R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Introduction to Computational Biology"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "CG2271 or EE4214. CEG students are not allowed to take this module.", "code": "CS2106R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Introduction to Operating Systems"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "Nil", "code": "CS2105R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Introduction to Computer Networks"}, {"workload": "1-0-0-1-0.5", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "CS2102S, IT2002", "code": "CS2102R", "desc": "The aim of this module is to introduce the fundamental concepts and techniques necessary for the understanding and practice of design and implementation of database applications and of the management of data with relational database management systems. The module covers practical and theoretical aspects of design with entity-relationship model, theory of functional dependencies and normalisation by decomposition in second, third and Boyce-Codd normal forms. The module covers practical and theoretical aspects of programming with SQL data definition and manipulation sublanguages, relational tuple calculus, relational domain calculus and relational algebra.", "tutorial_time_table": [{"name": "RECITATION Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/209"}]}], "prerequisite": "(CS1020 or its equivalent) and (CS1231 or MA1100)", "name": "Database Systems"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "CS1104 or Students from Department of ECE", "code": "CS2100R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Computer Organisation"}, {"workload": "0-0-0-2-1", "exam": "null", "mc": "1", "lecture_time_table": "null", "preclusion": "CG1101, CS1010, CS1010E, CS1101, CS1101C, CZ1102, IT1002, Engineering students", "code": "CS1010R", "desc": "This 1-MC module adds a research component to the host module, enabling students to acquire more in-depth understanding of the research issues pertaining to the subject matter.", "tutorial_time_table": "null", "prerequisite": "Co-read with host module in current semester or pass host module in previous semester. Student selection process is enforced.", "name": "Programming Methodology"}, {"workload": "2-0-0-6-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "2030", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1830", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS5218", "desc": "Program analysis are static (compile-time) techniques for computing approximate and yet reliable information about the dynamic behaviour of programs. This module lays the foundation for study of program analysis. It covers the essential mathematics upon which program analyses are built, and provides an overview of different approaches to program analysis. Topics include: Partially ordered sets, induction and co-induction, data flow analysis, constraint based analysis, abstract interpretation, and type and effect systems. Students with interest in programming-language design and compiler design will find this module beneficial.", "tutorial_time_table": "null", "prerequisite": "CS3212 or CS4212.", "name": "Principles of Program Analysis"}, {"workload": "2-0.5-1-5-2.5", "exam": {"date": "2012-04-21", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "SR@LT19"}]}, {"name": "LECTURE Class [2]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1500", "location": "SR@LT19"}]}], "preclusion": "Nil", "code": "CS3240", "desc": "This course is intended for students in computing disciplines whose work focuses on human-computer interaction issues in the design of software systems. The course stresses the importance of user-centred design and usability in the development of software applications and systems. Students will be taken through the analysis, design, development, and evaluation of human-computer interaction methods for software systems. They will acquire hands-on design skills through interaction design project. The course also covers HCI design principles and emphasises the importance of contextual, organisational, and social factors in system design.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "AS6/426"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "AS6/426"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "AS6/426"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "AS6/426"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1300", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/215"}]}], "prerequisite": "(CS1010 or its equivalent) or IT1002", "name": "Human-Computer Interaction"}, {"workload": "2-1-0-3-3", "exam": {"date": "2012-05-04", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/204"}]}], "preclusion": "Nil", "code": "CS3223", "desc": "This module provides an in-depth study of the concepts and implementation issues related to database management systems. It first covers the physical implementation of relational data model, which includes storage management, access methods, query processing, and optimisation. Then it covers issues and techniques dealing with multi-user application environments, namely, transactions, concurrency control and recovery. The third part covers object-database systems that are useful extension of relational databases to deal with complex data types. The last part covers database technologies required for modern decision support systems, including data warehousing, data mining and knowledge discovery and on-line analytical processing.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1500", "location": "COM2/106"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM2/106"}]}], "prerequisite": "(CS2010 or its equivalent) and (CS2102 or CS2102S)", "name": "Database Systems Implementation"}, {"workload": "1-1-0-9-2", "exam": "null", "mc": "5", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "SR@LT19"}, {"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "SR@LT19"}]}], "preclusion": "Nil", "code": "CS3217", "desc": "This module introduces students to the practice of software engineering on modern application platforms such as mobile devices, the Web and cloud systems. Students will work in small project teams to develop well-tested, production-quality software. This module focuses on building core software engineering skills and competencies in programming modern application platforms. It also trains students to work well in project teams. Students will be assessed on both their individual programming competencies and their software enginnering skills in final team project.", "tutorial_time_table": [{"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1500", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1600", "location": "COM1/215"}]}], "prerequisite": "CS2103 or with special approval from instructor. Students will submit personal statements to apply for a place in the course instead of bidding through the CORS system.", "name": "Software Engineering on Modern Application Platforms"}, {"workload": "2-1-0-3-3", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "LT15"}]}], "preclusion": "Nil", "code": "CS3211", "desc": "A concurrent system consists of a set of processes that executes simultaneously and that may collaborate by communicating and synchronising with one another. Examples of concurrent systems are parallel programs that describe sets of collaborating processes. This module introduces the design, development and debugging of parallel programs. It will build on the concurrency concepts gained from the Operating Systems module. It covers concepts and modelling tools for specifying and reasoning (about the properties of) concurrent systems and parallel programs. It also covers principles of performance analysis, asynchronous and asynchronous parallel programming, and engineering concurrent systems and parallel programs.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1100", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/211"}]}], "prerequisite": "CS2106 or CG2271", "name": "Parallel and Concurrent Programming"}, {"workload": "1-1-0-5-3", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1500", "location": "SR@ICube"}]}], "preclusion": "CS3215 Software Engineering Project", "code": "CS3202", "desc": "This module is the second part of a two-part series on the practice of software engineering in Software Development Life Cycle (SDLC). These two modules together provide the students with hands-on experience in working in project groups through a complete SDLC to develop a well-tested, large-scaled software system. This second part focuses on applying best software engineering practices on the implementation and testing of the software system. The students will practice efficient implementation of software components, system integration, software version control, and rigorous testing.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1100", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/210"}]}], "prerequisite": "CS3201", "name": "Software Engineering Project II"}, {"workload": "1-1-0-5-3", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "LT15"}]}], "preclusion": "CS3215", "code": "CS3201", "desc": "This module is the first part of a two-part series on the practice of software engineering in Software Development Life Cycle (SDLC). These two modules together provide the students with hands-on experience in working in project groups through a complete SDLC to develop a well-designed, welltested, large-scaled software system. This first part focuses on applying best software engineering practices on the analysis and design of software system. The students will practice analysis of user&#8217;s needs, formulation of computing requirements to meet the user&#8217;s needs, modeling and design of the computer systems according to the requirements, and evaluation of the design.", "tutorial_time_table": [{"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "COM1/215"}]}], "prerequisite": "CS2103 and (CS2301 or IS2101)", "name": "Software Engineering Project I"}, {"workload": "2-1-0-4-3", "exam": {"date": "2012-04-26", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/203"}]}], "preclusion": "EE4210 Computer Communication Networks II", "code": "CS3103", "desc": "This module focuses mainly on TCP/IP protocol stack and discusses the design of various protocols in the stack, their semantics and interoperability issues including concepts behind in designing such protocols. The Internet technology protocols like ARP, ICMP, IP, DHCP, DNS, TCP, UDP, Routing protocols like OSPF and new IP protocol version IPv6 are discussed in detail. The dynamics of the TCP protocol is discussed in detail including congestion control and its behaviour in the wireless and mobile network environment. The client server communication paradigm is introduced and students are given the opportunity to develop distributed application using sockets and/or RPC-XML.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/215"}]}], "prerequisite": "(CS2105 Introduction to Computer Networks or EE3204 Computer Communication Networks I) and co-read CS3103L Computer Networks Laboratory", "name": "Computer Networks and Protocols"}, {"workload": "2-0-1-3-2", "exam": {"date": "2012-05-02", "time": "AM"}, "mc": "3", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/212"}]}], "preclusion": "CS1101C or CS1102C", "code": "CS2281", "desc": "This module aims to train students to be proficient in dealing with UNIX systems. Topics include: C programming: Variables, types, operators, expressions, control flow, functions, function arguments, recursion, pointers, address arithmetic, arrays, structures, standard input/output. Unix system interface: file/directory manipulation, system data files, Unix processes, process control, signals, inter-process communication (pipe, FIFO), terminal I/O. Unix tools: shell programming (Bourne shell), programming tools (Xemacs, gcc, make, ddd debugger), regular expressions and text utilities (grep, awk, sed).", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1500", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "COM1/B08"}]}], "prerequisite": "CS1020 or its equivalent", "name": "Programming in UNIX"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-28", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "LT19"}]}], "preclusion": "Nil", "code": "CS2107", "desc": "This module serves as an introductory module on information and computer system security. It illustrates the fundamentals of how systems fail due to malicious activities and how they can be protected. The module also places emphasis on the practices of secure programming and implementation. Topics covered include classical/historical ciphers, introduction to modern ciphers and cryptosystems, ethical, legal and organisational aspects, classic examples of direct attacks on computer systems such as input validation vulnerability, examples of other forms of attack such as social engineering/phishing attacks, and the practice of secure programming.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1700", "location": "COM2/107"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "COM2/106"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM2/106"}]}], "prerequisite": "CS1010 or its equivalence", "name": "Introduction to Information and System Security"}, {"workload": "2-1-1-0-4", "exam": {"date": "2012-04-25", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "LT15"}]}], "preclusion": "CG2271 or EE4214. CEG students are not allowed to take this module.", "code": "CS2106", "desc": "This module introduces the basic concepts in operating systems and links it with contemporary operating systems (eg. Unix/Linux and Windows). It focuses on OS structuring and architecture, processes, memory management, concurrency and file systems. Topics include kernel architecture, system calls, interrupts, models of processes, process abstraction and services, scheduling, review of physical memory and memory management hardware, kernel memory management, virtual memory and paging, caches, working set, deadlock, mutual exclusion, synchronisation mechanisms, data and metadata in file systems, directories and structure, file system abstraction and operations. Examples will be discussed from contemporary operating systems such as Unix/Linux and/or Windows.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [6]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/B13"}]}, {"name": "LABORATORY Class [7]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/B13"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1100", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1700", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "900", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1100", "location": "COM1/209"}]}], "prerequisite": "CS2100 or EE2007 or EE2024", "name": "Introduction to Operating Systems"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-24", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "LT19"}]}], "preclusion": "IT2001, EE3204/E, EE4210. EEE & CPE students are not allowed to take this module.", "code": "CS2105", "desc": "This course aims to provide a broad introduction to computer networks and some appreciations of network application programming. It covers a range of topics including basic data communication and computer network concepts, protocols, networked computing concepts and principles, network applications development and network security. The emphasis of teaching is on the working principles and application of computer networks. As an integral part of the course, tutorials and practical assignments enforcing learning will also be given. These assignments provide an early exposure in network application programming and they should be able to complete by using personal computers and school?s network facilities.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1500", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/210"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1300", "location": "COM1/215"}]}], "prerequisite": "(CS1020 or CS1020E or CS1102 or CS1102C or CS1102S) and (CS1104 or CS2100)", "name": "Introduction to Computer Networks"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": "null", "preclusion": "CS2103 Software Engineering, IS2101 Business Technical Communication or its equivalent.", "code": "CS2103T", "desc": "This module introduces the necessary conceptual and analytical tools for systematic and rigorous development of software systems. It covers four main areas of software development, namely object-oriented system analysis, object-oriented system modelling and design, implementation, and testing, with emphasis on system modelling, design and implementation of software modules that work cooperatively to fulfill the system&#8217;s requirements. Tools for software development, such as Universal Modelling Language, program specification, and testing methods will be taught. Software engineering issues such as modularisation criteria, program correctness, and software quality will be covered. This module must be taken together with CS2101 Effective Communication for Technologists.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "900", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "COM1/211"}]}], "prerequisite": "For SoC students only. CS1020 or its equivalent.", "name": "Software Engineering"}, {"workload": "2-1-0-3-4", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [2]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "I3/Aud"}]}], "preclusion": "Science students majoring in Computational Finance, are not allowed to read it as CFM/Breadth. EEE and CPE students can only take this module as a technical elective to satisfy the program requirements or UEM but not CFM/ULR-Breadth.", "code": "CS2103", "desc": "This module introduces the necessary conceptual and analytical tools for systematic and rigorous development of software systems. It covers four main areas of software development, namely objectoriented system analysis, object-oriented system modelling and design, implementation, and testing, with emphasis on system modelling and design and implementation of software modules that work cooperatively to fulfill the requirements of the system. Tools and techniques for software development, such as Universal Modelling Language (UML), program specification, and testing methods, will be taught. Major software engineering issues such as modularisation criteria, program correctness, and software quality will also be covered.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [10]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [12]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [13]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1100", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1100", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1500", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1700", "location": "COM1/216"}]}], "prerequisite": "(CS1020 or its equivalent)", "name": "Software Engineering"}, {"workload": "2-1.5-0.5-3-3", "exam": {"date": "2012-04-27", "time": "PM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1300", "location": "LT15"}]}], "preclusion": "CS2102S, IT2002", "code": "CS2102", "desc": "The aim of this module is to introduce the fundamental concepts and techniques necessary for the understanding and practice of design and implementation of database applications and of the management of data with relational database management systems. The module covers practical and theoretical aspects of design with entity-relationship model, theory of functional dependencies and normalisation by decomposition in second, third and Boyce-Codd normal forms. The module covers practical and theoretical aspects of programming with SQL data definition and manipulation sublanguages, relational tuple calculus, relational domain calculus and relational algebra.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "800", "location": "COM1/209"}, {"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "800", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/209"}, {"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/209"}, {"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/209"}, {"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/211"}, {"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM2/105"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM2/108"}, {"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/B11"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM2/108"}, {"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/B11"}]}], "prerequisite": "(CS1020 or its equivalent) and (CS1231 or MA1100)", "name": "Database Systems"}, {"workload": "0-4-0-4-2", "exam": "null", "mc": "4", "lecture_time_table": [{"name": "SECTIONAL TEACHING Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM2/105"}, {"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM2/106"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "D1@ICube"}]}, {"name": "SECTIONAL TEACHING Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM2/106"}, {"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM2/106"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "D2@ICube"}]}, {"name": "SECTIONAL TEACHING Class [3]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM2/107"}, {"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM2/108"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "D3@ICube"}]}, {"name": "SECTIONAL TEACHING Class [4]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM2/106"}, {"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM2/106"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "D4@ICube"}]}], "preclusion": "CS2103 Software Engineering, IS2101 Business Technical Communication or its equivalent", "code": "CS2101", "desc": "This module aims to equip students with the skills needed to communicate technical information to technical and nontechnical audiences, and to create comprehensible software documentation. A student-centric approach will be adopted to encourage independent and collaborative learning while engaging students in team-based projects. Students will learn interpersonal and intercultural communication skills as well as hone their oral and written communication skills. Assessment modes include a variety of oral and written communication tasks such as reports, software guides, oral presentations, software demonstrations and project blogs.", "tutorial_time_table": "null", "prerequisite": "Students have to complete ES1000 and/or ES1102 (if required to take the module/s) before reading this module.", "name": "Effective Communication for Computing Professionals"}, {"workload": "3-1-1-3-2", "exam": {"date": "2012-04-21", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1300", "location": "LT19"}, {"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "LT19"}]}], "preclusion": "CS1104 or Students from Department of ECE", "code": "CS2100", "desc": "The objective of this module is to familiarise students with the fundamentals of computing devices. Through this module students will understand the basics of data representation, and how the various parts of a computer work, separately and with each other. This allows students to understand the issues in computing devices, and how these issues affect the implementation of solutions. Topics covered include data representation systems, combinational and sequential circuit design techniques, assembly language, processor execution cycles, pipelining, memory hierarchy and input/output systems.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/114"}]}, {"name": "LABORATORY Class [10]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "900", "location": "COM1/114"}]}, {"name": "LABORATORY Class [11]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/114"}]}, {"name": "LABORATORY Class [12]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1700", "location": "COM1/114"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/114"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1100", "location": "COM1/114"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1200", "location": "COM1/114"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1300", "location": "COM1/114"}]}, {"name": "LABORATORY Class [6]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/114"}]}, {"name": "LABORATORY Class [7]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1500", "location": "COM1/114"}]}, {"name": "LABORATORY Class [8]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/114"}]}, {"name": "LABORATORY Class [9]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1700", "location": "COM1/114"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [10]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1100", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [11]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1100", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1400", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1500", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1700", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "900", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [9]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/208"}]}], "prerequisite": "CS1010 or its equivalent", "name": "Computer Organisation"}, {"workload": "4-2-2-4-3", "exam": {"date": "2012-05-03", "time": "AM"}, "mc": "6", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/204"}, {"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "LT15"}]}], "preclusion": "CG1102, CG1103, CS1020, CS1020E, CS2010, CS1102, CS1102C, CS1102S", "code": "CS2020", "desc": "This module is an accelerated version that combines CS1020 and CS2010. It continues the introduction in CS1010, and emphasises object-oriented programming with application to data structures. Topics covered include object-oriented problem modeling with concepts of objects, classes and methods, object-oriented problem formulation and problem solving, data structure design principles and implementation strageties, abstraction and encapsulation of data structures, object-oriented programming constructs, use of APIs and class libraries, exception handling, lists, linked lists, stacks, queues, hash tables, trees, graphs, and their algorithmic design, various forms of sorting and searching methods, recursive algorithms, and algorithm analysis.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "I3/3-47"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "I3/3-47"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "I3/3-46"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "I3/3-47"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "I3/3-46"}]}, {"name": "LABORATORY Class [6]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "I3/3-46"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1300", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1500", "location": "COM1/211"}]}], "prerequisite": "Obtain a grade of at least A- in either CS1010 or CS1101S Programming Methodology", "name": "Data Structures and Algorithms Accelerated"}, {"workload": "2-1-1-3-3", "exam": {"date": "2012-04-30", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "LT19"}]}], "preclusion": "CG1102, CS1102, CS1102C, CS1102S, CS2020", "code": "CS2010", "desc": "This module is the third part of a three-part series on introductory programming and problem solving by computing. It continues the introduction in CS1010 and CS1020, and emphasises object-oriented programming with application to complex data structures. Topics covered include trees, binary search trees, order property, prefix/infix/postfix expressions, heaps, priority queues, graphs and their algorithmic design, recursive algorithms, problem formulation and problem solving with applications of complex data structures, data structure design principles and implementation strategies, and algorithm analysis. Advanced data structures such as B-trees and AVL trees are also covered.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "900", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "800", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "700", "location": "COM1/120"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "900", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "800", "location": "COM1/120"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1100", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "900", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "800", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1300", "location": "COM1/203"}]}], "prerequisite": "CS1020 or CS1020E or CG1103 Data Structures and Algorithms I", "name": "Data Structures and Algorithms II"}, {"workload": "3-1-0-3-3", "exam": {"date": "2012-04-25", "time": "EVENING"}, "mc": "4", "lecture_time_table": [{"name": "SECTIONAL TEACHING Class [1]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1000", "location": "LT15"}, {"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "1600", "location": "LT15"}]}], "preclusion": "MA1100", "code": "CS1231", "desc": "This module introduces mathematical tools required in the study of computer science. Topics include: (1) Logic and proof techniques: propositions, conditionals, quantifications. (2) Relations and Functions: Equivalence relations and partitions. Partially ordered sets. Well-Ordering Principle. Function equality. Boolean/identity/inverse functions. Bijection. (3) Mathematical formulation of data models (linear model, trees, graphs). (4) Counting and Combinatoric: Pigeonhole Principle. Inclusion-Exclusion Principle. Number of relations on a set, number of injections from one finite set to another, Diagonalisation proof: An infinite countable set has an uncountable power set; Algorithmic proof: An infinite set has a countably infinite subset. Subsets of countable sets are countable.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [10]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [11]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "900", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [12]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [13]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "COM1/209"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1000", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1100", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1700", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "900", "location": "COM1/208"}]}, {"name": "TUTORIAL Class [9]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/208"}]}], "prerequisite": "A-level Mathematics or H2 Mathematics or MA1301", "name": "Discrete Structures"}, {"workload": "2-1-1-3-3", "exam": {"date": "2012-04-27", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "LECTURE Class [1]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "LT15"}]}], "preclusion": "CG1102, CG1103, CS1020, CS1102, CS1102C, CS1102S, CS2020", "code": "CS1020E", "desc": "This module is the second part of a three-part series on introductory programming and problem solving by computing. It continues the introduction that begins in CS1010, and emphasises objectoriented programming with application to simple data structures. Topics include object-oriented problem modeling with objects, classes and methods, object-oriented problem formulation and solving, data structure implementation strageties, abstraction and encapsulation of data structures, object-oriented programming constructs, APIs and class libraries, exception handling, lists, linked lists, stacks, queues, hash tables and their algorithmic design, sorting and searching methods, recursive algorithms, and Big-O notation. This module is appropriate for FoE students.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/B08"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1300", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/203"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1300", "location": "COM1/211"}]}, {"name": "TUTORIAL Class [9]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/211"}]}], "prerequisite": "CS1010E Programming Methodology", "name": "Data Structures and Algorithms I"}, {"workload": "2-1-1-3-3", "exam": {"date": "2012-04-27", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "SECTIONAL TEACHING Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "LT19"}]}, {"name": "SECTIONAL TEACHING Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/B09"}]}, {"name": "SECTIONAL TEACHING Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/B09"}]}], "preclusion": "CG1102, CG1103, CS1020E, CS1102, CS1102C, CS1102S, CS2020", "code": "CS1020", "desc": "This module is the second part of a three-part series on introductory programming and problem solving by computing. It continues the introduction that begins in CS1010, and emphasises objectoriented programming with application to simple data structures. Topics include object-oriented problem modeling with objects, classes and methods, object-oriented problem formulation and solving, data structure implementation strageties, abstraction and encapsulation of data structures, object-oriented programming constructs, APIs and class libraries, exception handling, lists, linked lists, stacks, queues, hash tables and their algorithmic design, sorting and searching methods, recursive algorithms, and Big-O notation. This module is appropriate for SoC and FoS students.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/B09"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/B09"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/B11"}]}, {"name": "LABORATORY Class [6]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/B11"}]}, {"name": "LABORATORY Class [7]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1000", "location": "COM1/120"}]}, {"name": "LABORATORY Class [8]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1200", "location": "COM1/120"}]}, {"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "900", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [10]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1100", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1100", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1500", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1700", "location": "COM1/215"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/216"}]}, {"name": "TUTORIAL Class [9]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1500", "location": "COM1/216"}]}], "prerequisite": "CS1010 Programming Methodology", "name": "Data Structures and Algorithms I"}, {"workload": "2-1-1-3-3", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "SECTIONAL TEACHING Class [1]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1600", "location": "LT7A"}]}], "preclusion": "CG1101, CS1010, CS1101, CS1101C, CS1101S, CZ1102, IT1002", "code": "CS1010E", "desc": "This module introduces the fundamental concepts of problem solving by computing and programming using an imperative programming language. It is the first and foremost introductory course to computing and the first part of a three-part series on programming and problem solving by computing, which includes CS1020 and CS2010. Topics include problem solving by computing, writing pseudo-codes, problem formulation and problem solving, program development, coding, testing and debugging, fundamental programming constructs (variables, types, expressions, assignments, functions, control structures, etc.), fundamental data structures: arrays, strings and structures, simple file processing, and basic recursion. This module is appropriate for FoE students.", "tutorial_time_table": [{"name": "LABORATORY Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1000", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [10]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1600", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [4]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/B08"}]}, {"name": "LABORATORY Class [5]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1200", "location": "COM1/B09"}]}, {"name": "LABORATORY Class [6]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/B09"}]}, {"name": "LABORATORY Class [7]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1600", "location": "COM1/B09"}]}, {"name": "LABORATORY Class [8]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1600", "location": "COM1/B12"}]}, {"name": "LABORATORY Class [9]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "COM1/B08"}]}, {"name": "TUTORIAL Class [C17]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "E2-03-02"}]}, {"name": "TUTORIAL Class [C18]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "E2-03-03"}]}, {"name": "TUTORIAL Class [C19]", "sessions": [{"endtime": "1000", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "E3-06-08"}]}, {"name": "TUTORIAL Class [D01]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "E1-06-06"}]}, {"name": "TUTORIAL Class [D02]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "E1-06-07"}]}, {"name": "TUTORIAL Class [D03]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1500", "location": "E1-06-03"}]}, {"name": "TUTORIAL Class [D14]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "E1-06-01"}]}, {"name": "TUTORIAL Class [D15]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1100", "location": "E1-06-03"}]}], "prerequisite": "nil", "name": "Programming Methodology"}, {"workload": "2-1-1-3-3", "exam": {"date": "2012-04-23", "time": "AM"}, "mc": "4", "lecture_time_table": [{"name": "SECTIONAL TEACHING Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 1, "starttime": "900", "location": "COM1/B09"}]}, {"name": "SECTIONAL TEACHING Class [2]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "900", "location": "COM1/B09"}]}, {"name": "SECTIONAL TEACHING Class [3]", "sessions": [{"endtime": "1500", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1200", "location": "COM1/B12"}]}, {"name": "SECTIONAL TEACHING Class [4]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 3, "starttime": "1400", "location": "I3/3-45"}]}, {"name": "SECTIONAL TEACHING Class [SM2]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/120"}]}, {"name": "SECTIONAL TEACHING Class [SM3]", "sessions": [{"endtime": "1700", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/120"}]}], "preclusion": "CG1101, CS1010E, CS1101, CS1101C, CS1101S, CZ1102, IT1002. Engineering and Science students who require this module for their majors/minors are not allowed to read it as ULR-Breadth.", "code": "CS1010", "desc": "This module introduces the fundamental concepts of problem solving by computing and programming using an imperative programming language. It is the first and foremost introductory course to computing and the first part of a three-part series on programming and problem solving by computing, which includes CS1020 and CS2010. Topics include problem solving by computing, writing pseudo-codes, problem formulation and problem solving, program development, coding, testing and debugging, fundamental programming constructs (variables, types, expressions, assignments, functions, control structures, etc.), fundamental data structures: arrays, strings and structures, simple file processing, and basic recursion. This module is appropriate for SoC and FoS students.", "tutorial_time_table": [{"name": "TUTORIAL Class [1]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/B08"}]}, {"name": "TUTORIAL Class [10]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "I3/3-47"}]}, {"name": "TUTORIAL Class [11]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "I3/3-47"}]}, {"name": "TUTORIAL Class [2]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/B08"}]}, {"name": "TUTORIAL Class [3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/120"}]}, {"name": "TUTORIAL Class [4]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1600", "location": "COM1/120"}]}, {"name": "TUTORIAL Class [5]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1400", "location": "COM1/B09"}]}, {"name": "TUTORIAL Class [6]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "COM1/B09"}]}, {"name": "TUTORIAL Class [7]", "sessions": [{"endtime": "1200", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1000", "location": "COM1/B09"}]}, {"name": "TUTORIAL Class [8]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "I3/3-46"}]}, {"name": "TUTORIAL Class [9]", "sessions": [{"endtime": "1400", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 5, "starttime": "1200", "location": "I3/3-47"}]}, {"name": "TUTORIAL Class [SM2]", "sessions": [{"endtime": "1800", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1600", "location": "COM1/B08"}, {"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 4, "starttime": "1400", "location": "COM1/B10"}]}, {"name": "TUTORIAL Class [SM3]", "sessions": [{"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/B11"}, {"endtime": "1600", "occurence": [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13], "day": 2, "starttime": "1400", "location": "COM1/B08"}]}], "prerequisite": "Nil", "name": "Programming Methodology"}]